{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}]}}}, "outputs": {"predictions": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7200"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_max_pooling1d/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/predictions/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/predictions/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "input_1", "StatefulPartitionedCall/model/token_and_position_embedding/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_INT64"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/Shape", "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack", "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack_1", "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/range", "op": "Range", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/range/start", "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice", "StatefulPartitionedCall/model/token_and_position_embedding/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/model/token_and_position_embedding/range", "StatefulPartitionedCall/model/token_and_position_embedding/embedding_1/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/embedding/embedding_lookup", "StatefulPartitionedCall/model/token_and_position_embedding/embedding_1/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/add", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/add", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/add", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/einsum/Einsum", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/einsum/Einsum", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/einsum/Einsum", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/add", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/add", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/Mul"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/softmax/Softmax", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/add"], "attr": {"equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/einsum_1/Einsum", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/einsum/Einsum", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/token_and_position_embedding/add", "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/transformer_block/add", "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/transformer_block/add", "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/SquaredDifference", "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/variance", "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/Rsqrt", "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/mean", "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/add", "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/ReadVariableOp", "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Shape", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/axes", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Shape", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/free", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const_2", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Prod", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Reshape", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/MatMul", "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot", "StatefulPartitionedCall/model/transformer_block/sequential/dense/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Shape", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/axes", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Shape", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/free", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const_2", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Prod", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense/Relu", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Reshape", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/MatMul", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/transformer_block/add_1", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/transformer_block/add_1", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/SquaredDifference", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/variance", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/Rsqrt", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/mean", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/transformer_block/add_1", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/ReadVariableOp", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_max_pooling1d/Max", "op": "Max", "input": ["StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/model/global_max_pooling1d/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/predictions/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/global_max_pooling1d/Max", "StatefulPartitionedCall/model/predictions/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/predictions/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/predictions/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/predictions/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/predictions/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/ReadVariableOp", "shape": [512, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/ReadVariableOp", "shape": [192, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/einsum/Einsum/ReadVariableOp", "shape": [192, 2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/key/add/ReadVariableOp", "shape": [2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/einsum/Einsum/ReadVariableOp", "shape": [192, 2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/query/add/ReadVariableOp", "shape": [2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/Mul/y", "shape": [], "dtype": "float32"}, {"name": "unknown_0", "shape": [7200, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [60, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/range/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/range/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/token_and_position_embedding/embedding_1/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/einsum/Einsum/ReadVariableOp", "shape": [192, 2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/value/add/ReadVariableOp", "shape": [2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp", "shape": [2, 192, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/multi_head_attention/attention_output/add/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization/batchnorm/mul/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/transformer_block/layer_normalization_1/batchnorm/mul/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/global_max_pooling1d/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/predictions/MatMul/ReadVariableOp", "shape": [192, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/predictions/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}