{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_5": {"name": "input_5:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}]}}}, "outputs": {"predictions": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7200"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_4/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_5/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/global_max_pooling1d_2/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/predictions/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/predictions/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_4/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "input_5", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_4/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/Shape", "op": "Shape", "input": ["input_5"], "attr": {"T": {"type": "DT_INT64"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/Shape", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack_1", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range", "op": "Range", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/range/start", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_5/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_5/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_4/embedding_lookup", "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_5/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/einsum/Einsum", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/einsum/Einsum", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/einsum/Einsum", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/add", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/add", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/Mul"], "attr": {"equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/softmax/Softmax", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/add"], "attr": {"equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/einsum_1/Einsum", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/einsum/Einsum", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/token_and_position_embedding_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/SquaredDifference", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/variance", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/Rsqrt", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/mean", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/add", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/ReadVariableOp", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul_1", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Shape", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/axes", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Shape", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/free", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const_2", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Prod", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add_1", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Reshape", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/MatMul", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Shape", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/axes", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Shape", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/free", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const_2", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Prod", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Relu", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Reshape", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/MatMul", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add_1", "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/add_1", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/add_1", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/SquaredDifference", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/variance", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/Rsqrt", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/mean", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/add_1", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/ReadVariableOp", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul_1", "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/global_max_pooling1d_2/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add_1", "StatefulPartitionedCall/model_4/global_max_pooling1d_2/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/predictions/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/global_max_pooling1d_2/Max", "StatefulPartitionedCall/model_4/predictions/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/predictions/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/predictions/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_4/predictions/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_4/predictions/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/ReadVariableOp", "shape": [512, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/ReadVariableOp", "shape": [192, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/einsum/Einsum/ReadVariableOp", "shape": [192, 2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/key/add/ReadVariableOp", "shape": [2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/einsum/Einsum/ReadVariableOp", "shape": [192, 2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/query/add/ReadVariableOp", "shape": [2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/Mul/y", "shape": [], "dtype": "float32"}, {"name": "unknown_0", "shape": [7200, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_4/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [60, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/range/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/token_and_position_embedding_2/embedding_5/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/einsum/Einsum/ReadVariableOp", "shape": [192, 2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/value/add/ReadVariableOp", "shape": [2, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/einsum/Einsum/ReadVariableOp", "shape": [2, 192, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/multi_head_attention_2/attention_output/add/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_4/batchnorm/mul/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_4/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/sequential_2/dense_5/BiasAdd/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/transformer_block_2/layer_normalization_5/batchnorm/mul/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/global_max_pooling1d_2/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/predictions/MatMul/ReadVariableOp", "shape": [192, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/predictions/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}